print('Задача 5. Полёт')

# Что нужно сделать
# Напишите программу для сервиса заказа билетов,
# которая запрашивает у пользователя город вылета и город прилёта. 
# Затем выведите их в одну строку через тире. 
# Обратите внимание на свои переменные: названия должны отражать содержимое.
out_city = input('Введите город вылета: ')
in_city = input('Введите город прибытия: ')
print(out_city, '-', in_city)