print('Задача 1. Пропавшая переменная')
# Что нужно сделать
# Найдите в программе необъявленную переменную и объявите её, присвоив ей значение ‘Кот’.

client = 'Петя'
pet = 'Кот'
print(client)
print(' и ')
print(pet)