print('Задача 6. Маятник ')

# Известно, что амплитуда качающегося маятника с каждым разом затухает
# на 8,4% от амплитуды прошлого колебания. 
# Если качнуть маятник,
# то, строго говоря, он не остановится никогда, 
# просто амплитуда будет постоянно уменьшаться до тех пор, 
# пока мы не сочтём такой маятник остановившимся. 
 
# Напишите программу, 
# определяющую, сколько раз качнётся маятник, прежде чем он, по нашему мнению, остановится. 
 
# Программа получает на вход
# начальную амплитуду колебания в сантиметрах 
# и конечную амплитуду его колебаний,
# которая считается остановкой маятника. 

# Обеспечьте контроль ввода.

# Пример:

# Введите начальную амплитуду: 1
# Введите амплитуду остановки: 0.1
 
# Маятник считается остановившимся через 27 колебаний

def down(start_amplitude, end_amplitude, step):
  if start_amplitude > end_amplitude:
    return down(start_amplitude * 0.916, end_amplitude, step + 1)
  else:
    return step
    
start_amplitude = float(input('Введите начальную амплитуду: '))
end_amplitude = float(input('Введите амплитуду остановки: '))

print('Маятник считается остановившимся через', down(start_amplitude, end_amplitude, 0), 'колебаний')
