print('Задача 2. Функция максимума')

# Юра пишет различные полезные функции для Питона, 
# чтобы остальным программистам стало проще работать.

# Он захотел написать функцию, 
# которая будет находить максимум из перечисленных чисел.
# Функция для нахождения максимума из двух чисел у него уже есть.
 
# Юра задумался: может быть, её можно как-то использовать 
# для нахождения максимума уже от трёх чисел?
 
 
# Напишите программу, 
# которая находит максимум из трёх чисел.
# Для этого используйте только функцию нахождения максимума из двух чисел.

def maximum(a, b):
  if a > b:
    return a
  else:
    return b

a, b, c = float(input('Введите число 1: ')), float(input('Введите число 2: ')), float(input('Введите число 3: '))

print('Максимально число: ', maximum(maximum(a, b), c))